#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: kouxi08, Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
data.sakuracloud_archive.ubuntu_archive: Reading...
data.sakuracloud_archive.ubuntu_archive: Read complete after 1s [id=113600510456]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] will be created
  + resource "sakuracloud_disk" "k8s_control_plane_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "k8s-dev-control-plane-1"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + source_archive_id    = "113600510456"
      + tags                 = [
          + "dev",
          + "k8s",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] will be created
  + resource "sakuracloud_disk" "k8s_control_plane_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "k8s-dev-control-plane-2"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + source_archive_id    = "113600510456"
      + tags                 = [
          + "dev",
          + "k8s",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] will be created
  + resource "sakuracloud_disk" "k8s_control_plane_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "k8s-dev-control-plane-3"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + source_archive_id    = "113600510456"
      + tags                 = [
          + "dev",
          + "k8s",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_rook_disk[0] will be created
  + resource "sakuracloud_disk" "k8s_rook_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "k8s-dev-rook-1"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + tags                 = [
          + "dev",
          + "k8s",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_rook_disk[1] will be created
  + resource "sakuracloud_disk" "k8s_rook_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "k8s-dev-rook-2"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + tags                 = [
          + "dev",
          + "k8s",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_rook_disk[2] will be created
  + resource "sakuracloud_disk" "k8s_rook_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "k8s-dev-rook-3"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + tags                 = [
          + "dev",
          + "k8s",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_rook_disk[3] will be created
  + resource "sakuracloud_disk" "k8s_rook_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "k8s-dev-rook-4"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + tags                 = [
          + "dev",
          + "k8s",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_rook_disk[4] will be created
  + resource "sakuracloud_disk" "k8s_rook_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "k8s-dev-rook-5"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + tags                 = [
          + "dev",
          + "k8s",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_rook_disk[5] will be created
  + resource "sakuracloud_disk" "k8s_rook_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "k8s-dev-rook-6"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + tags                 = [
          + "dev",
          + "k8s",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_rook_disk[6] will be created
  + resource "sakuracloud_disk" "k8s_rook_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "k8s-dev-rook-7"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + tags                 = [
          + "dev",
          + "k8s",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_rook_disk[7] will be created
  + resource "sakuracloud_disk" "k8s_rook_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "k8s-dev-rook-8"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + tags                 = [
          + "dev",
          + "k8s",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_router_disk[0] will be created
  + resource "sakuracloud_disk" "k8s_router_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "k8s-dev-router-1"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + source_archive_id    = "113600510456"
      + tags                 = [
          + "dev",
          + "k8s",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] will be created
  + resource "sakuracloud_disk" "k8s_worker_node_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "k8s-dev-worker-node-1"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + source_archive_id    = "113600510456"
      + tags                 = [
          + "dev",
          + "k8s",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] will be created
  + resource "sakuracloud_disk" "k8s_worker_node_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "k8s-dev-worker-node-2"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + source_archive_id    = "113600510456"
      + tags                 = [
          + "dev",
          + "k8s",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] will be created
  + resource "sakuracloud_disk" "k8s_worker_node_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "k8s-dev-worker-node-3"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + source_archive_id    = "113600510456"
      + tags                 = [
          + "dev",
          + "k8s",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_worker_node_disk[3] will be created
  + resource "sakuracloud_disk" "k8s_worker_node_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "k8s-dev-worker-node-4"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + source_archive_id    = "113600510456"
      + tags                 = [
          + "dev",
          + "k8s",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_worker_node_disk[4] will be created
  + resource "sakuracloud_disk" "k8s_worker_node_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "k8s-dev-worker-node-5"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + source_archive_id    = "113600510456"
      + tags                 = [
          + "dev",
          + "k8s",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_worker_node_disk[5] will be created
  + resource "sakuracloud_disk" "k8s_worker_node_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "k8s-dev-worker-node-6"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + source_archive_id    = "113600510456"
      + tags                 = [
          + "dev",
          + "k8s",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_worker_node_disk[6] will be created
  + resource "sakuracloud_disk" "k8s_worker_node_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "k8s-dev-worker-node-7"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + source_archive_id    = "113600510456"
      + tags                 = [
          + "dev",
          + "k8s",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_worker_node_disk[7] will be created
  + resource "sakuracloud_disk" "k8s_worker_node_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "k8s-dev-worker-node-8"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + source_archive_id    = "113600510456"
      + tags                 = [
          + "dev",
          + "k8s",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_internet.k8s_external_switch will be created
  + resource "sakuracloud_internet" "k8s_external_switch" {
      + band_width           = 100
      + gateway              = (known after apply)
      + id                   = (known after apply)
      + ip_addresses         = (known after apply)
      + ipv6_network_address = (known after apply)
      + ipv6_prefix          = (known after apply)
      + ipv6_prefix_len      = (known after apply)
      + max_ip_address       = (known after apply)
      + min_ip_address       = (known after apply)
      + name                 = "k8s-dev-external-switch"
      + netmask              = 27
      + network_address      = (known after apply)
      + server_ids           = (known after apply)
      + switch_id            = (known after apply)
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_control_plane[0] will be created
  + resource "sakuracloud_server" "k8s_control_plane" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-control-plane-1"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s-dev-control-plane-1"
          + ip_address      = (known after apply)
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.10"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_control_plane[1] will be created
  + resource "sakuracloud_server" "k8s_control_plane" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-control-plane-2"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s-dev-control-plane-2"
          + ip_address      = (known after apply)
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.11"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_control_plane[2] will be created
  + resource "sakuracloud_server" "k8s_control_plane" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-control-plane-3"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s-dev-control-plane-3"
          + ip_address      = (known after apply)
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.12"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_router[0] will be created
  + resource "sakuracloud_server" "k8s_router" {
      + commitment        = "standard"
      + core              = 1
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 1
      + name              = "k8s-dev-router-1"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s-dev-router-1"
          + ip_address      = (known after apply)
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.0"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[0] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-1"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s-dev-worker-node-1"
          + ip_address      = (known after apply)
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.20"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[1] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-2"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s-dev-worker-node-2"
          + ip_address      = (known after apply)
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.21"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[2] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-3"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s-dev-worker-node-3"
          + ip_address      = (known after apply)
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.22"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[3] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-4"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s-dev-worker-node-4"
          + ip_address      = (known after apply)
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.23"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[4] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-5"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s-dev-worker-node-5"
          + ip_address      = (known after apply)
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.24"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[5] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-6"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s-dev-worker-node-6"
          + ip_address      = (known after apply)
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.25"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[6] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-7"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s-dev-worker-node-7"
          + ip_address      = (known after apply)
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.26"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[7] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-8"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s-dev-worker-node-8"
          + ip_address      = (known after apply)
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.27"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_ssh_key_gen.gen_key will be created
  + resource "sakuracloud_ssh_key_gen" "gen_key" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "k8s-pub-key"
      + private_key = (sensitive value)
      + public_key  = (known after apply)
    }

  # sakuracloud_subnet.bgp_subnet will be created
  + resource "sakuracloud_subnet" "bgp_subnet" {
      + id              = (known after apply)
      + internet_id     = (known after apply)
      + ip_addresses    = (known after apply)
      + max_ip_address  = (known after apply)
      + min_ip_address  = (known after apply)
      + netmask         = 28
      + network_address = (known after apply)
      + next_hop        = (known after apply)
      + switch_id       = (known after apply)
      + zone            = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_switch.k8s_internal_switch will be created
  + resource "sakuracloud_switch" "k8s_internal_switch" {
      + id         = (known after apply)
      + name       = "k8s-dev-internal-switch"
      + server_ids = (known after apply)
      + zone       = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

Plan: 36 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + external_address_range       = (known after apply)
  + k8s_control_plane_ip_address = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + k8s_router_ip_address        = [
      + (known after apply),
    ]
  + k8s_worker_node_ip_address   = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + vip_address                  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>